# Challenge 3

In this challenge we will work on the `Orders` data set. In your work you will apply the thinking process and workflow we showed you in Challenge 2.

You are serving as a Business Intelligence Analyst at the headquarter of an international fashion goods chain store. Your boss today asked you to do two things for her:

**First, identify two groups of customers from the data set.** The first group is **VIP Customers** whose **aggregated expenses** at your global chain stores are **above the 95th percentile** (aka. 0.95 quantile). The second group is **Preferred Customers** whose **aggregated expenses** are **between the 75th and 95th percentile**.

**Second, identify which country has the most of your VIP customers, and which country has the most of your VIP+Preferred Customers combined.**

## Q1: How to identify VIP & Preferred Customers?

We start by importing all the required libraries:

In [7]:
# import required libraries
import pandas as pd
import numpy as np
import re

import warnings
warnings.filterwarnings('ignore')

Next, import `Orders` from Ironhack's database into a dataframe variable called `orders`. Print the head of `orders` to overview the data:

In [8]:
# your code here
orders = pd.read_csv('..\\your-code\\Orders.csv')

orders.head()

,Unnamed: 0,InvoiceNo,StockCode,year,month,day,hour,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country,amount_spent
0,0,536365,85123A,2010,12,3,8,white hanging heart t-light holder,6,2010-12-01 08:26:00,2.55,17850,United Kingdom,15.30
1,1,536365,71053,2010,12,3,8,white metal lantern,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
2,2,536365,84406B,2010,12,3,8,cream cupid hearts coat hanger,8,2010-12-01 08:26:00,2.75,17850,United Kingdom,22.00
3,3,536365,84029G,2010,12,3,8,knitted union flag hot water bottle,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34
4,4,536365,84029E,2010,12,3,8,red woolly hottie white heart.,6,2010-12-01 08:26:00,3.39,17850,United Kingdom,20.34

---

"Identify VIP and Preferred Customers" is the non-technical goal of your boss. You need to translate that goal into technical languages that data analysts use:

## How to label customers whose aggregated `amount_spent` is in a given quantile range?

We break down the main problem into several sub problems:

#### Sub Problem 1: How to aggregate the  `amount_spent` for unique customers?

#### Sub Problem 2: How to select customers whose aggregated `amount_spent` is in a given quantile range?

#### Sub Problem 3: How to label selected customers as "VIP" or "Preferred"?

*Note: If you want to break down the main problem in a different way, please feel free to revise the sub problems above.*

Now in the workspace below, tackle each of the sub problems using the iterative problem solving workflow. Insert cells as necessary to write your codes and explain your steps.

In [9]:
def firstel(x):
    
    return x.iloc[0]

customer_expenses = orders.groupby('CustomerID').agg({'amount_spent': 'sum',
                                  'Country': firstel})

In [10]:
customer_expenses.head()

            amount_spent         Country
CustomerID
12346           77183.60  United Kingdom
12347            4310.00         Iceland
12348            1797.24         Finland
12349            1757.55           Italy
12350             334.40          Norway

In [18]:
customer_expenses = customer_expenses.sort_values('amount_spent', ascending = False)

In [19]:
q75 = customer_expenses['amount_spent'].quantile(0.75)
q95 = customer_expenses['amount_spent'].quantile(0.95)

In [20]:
preferred_customers = customer_expenses[customer_expenses['amount_spent'].between(q75, q95)]

preferred_customers

            amount_spent         Country
CustomerID
13050            5836.86  United Kingdom
12720            5781.73         Germany
15218            5756.89  United Kingdom
17686            5739.46  United Kingdom
13178            5725.47  United Kingdom
...                  ...             ...
17656            1674.69  United Kingdom
16115            1667.97  United Kingdom
12912            1662.30  United Kingdom
12530            1662.28         Germany
13012            1661.84  United Kingdom

[868 rows x 2 columns]

In [21]:
VIP_customers = customer_expenses[customer_expenses['amount_spent'] >= q95]

VIP_customers

            amount_spent         Country
CustomerID
14646          280206.02     Netherlands
18102          259657.30  United Kingdom
17450          194550.79  United Kingdom
16446          168472.50  United Kingdom
14911          143825.06            EIRE
...                  ...             ...
14505            5905.64  United Kingdom
14415            5900.28  United Kingdom
14944            5900.25  United Kingdom
13209            5891.61  United Kingdom
13534            5870.08  United Kingdom

[217 rows x 2 columns]

Now we'll leave it to you to solve Q2 & Q3, which you can leverage from your solution for Q1:

## Q2: How to identify which country has the most VIP Customers?

In [22]:
VIP_customers['Country'].value_counts()

United Kingdom     177
Germany             10
France               9
Switzerland          3
EIRE                 2
Australia            2
Japan                2
Portugal             2
Spain                2
Channel Islands      1
Denmark              1
Finland              1
Netherlands          1
Norway               1
Singapore            1
Sweden               1
Cyprus               1
Name: Country, dtype: int64

## Q3: How to identify which country has the most VIP+Preferred Customers combined?

In [23]:
preferred_customers['Country'].value_counts()

United Kingdom     755
Germany             29
France              20
Belgium             11
Norway               6
Switzerland          6
Spain                5
Portugal             5
Italy                5
Finland              4
Channel Islands      3
Cyprus               2
Australia            2
Japan                2
Denmark              2
Israel               2
Poland               1
Canada               1
Iceland              1
EIRE                 1
Austria              1
Greece               1
Sweden               1
Malta                1
Lebanon              1
Name: Country, dtype: int64

In [24]:
VIP_customers['Country'].value_counts() + preferred_customers['Country'].value_counts()

Australia            4.0
Austria              NaN
Belgium              NaN
Canada               NaN
Channel Islands      4.0
Cyprus               3.0
Denmark              3.0
EIRE                 3.0
Finland              5.0
France              29.0
Germany             39.0
Greece               NaN
Iceland              NaN
Israel               NaN
Italy                NaN
Japan                4.0
Lebanon              NaN
Malta                NaN
Netherlands          NaN
Norway               7.0
Poland               NaN
Portugal             7.0
Singapore            NaN
Spain                7.0
Sweden               2.0
Switzerland          9.0
United Kingdom     932.0
Name: Country, dtype: float64

In [25]:
# El pais con el mayor numero de clientes VIP y preferred es United Kingdom con 932